app/views/people/_form.html.erb

SELECT `groups`.* FROM `groups` ORDER BY name
---
    <%= f.label :Group %><br />
    <%= collection_select(:person, :group_id, Group.all, :id, :name, { :selected => @person.group_id, :prompt => ""}, {}) %>