app/views/people/index.html.erb

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
---
    <td><%= person.name %></td>
    <td><%= if not person.group.nil? then person.group.name end %></td>