app/views/people/show.html.erb

  <b>Group:</b>
  <%= if not @person.group_id.nil? then Group.find(@person.group_id).name end %>
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1