app/views/groups/index.html.erb

<h2>Groups</h2>
<h3>Valid <%= Availability.first.fromDay.strftime("%m/%d/%Y") %> to <%= Availability.first.toDay.strftime("%m/%d/%Y") %> <%= link_to '(Change)', edit_availability_path(Availability.first) %></h3>
---
SELECT `availabilities`.* FROM `availabilities` LIMIT 1